jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_rtcs_adapter.c
/*
* Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*
* o Redistributions of source code must retain the above copyright notice, this list
*   of conditions and the following disclaimer.
*
* o Redistributions in binary form must reproduce the above copyright notice, this
*   list of conditions and the following disclaimer in the documentation and/or
*   other materials provided with the distribution.
*
* o Neither the name of Freescale Semiconductor, Inc. nor the names of its
*   contributors may be used to endorse or promote products derived from this
*   software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
* ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
* ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
* ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
* SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/
#include "fsl_enet_driver.h"
#include "fsl_enet_hal.h"
#include "fsl_phy_driver.h"
#include "fsl_enet_rtcs_adapter.h"
#include "fsl_clock_manager.h"
#include "fsl_interrupt_manager.h"
#include "fsl_os_abstraction.h"
#include <string.h>

/*******************************************************************************
 * Variables
 ******************************************************************************/
static enet_dev_if_t enetDevIf[HW_ENET_INSTANCE_COUNT];
enet_config_rmii_t rmiiCfg = {kEnetCfgRmii, kEnetCfgSpeed100M, kEnetCfgFullDuplex, false, false};
enet_mac_config_t g_enetMacCfg[HW_ENET_INSTANCE_COUNT] =
{
{
    kEnetMacNormalMode,  /*!< ENET normal mode*/
    kEnetMaxFrameSize,  /*!< ENET receive maximun frame length*/
    kEnetDefaultTruncLen,  /*!< ENET default frame truncation length*/
    kEnetDefaultIpg,       /*!< ENET default transmit inter packet gap*/
    0,                 /*!< ENET Pause duration*/
    NULL,      /*!< ENET mac address*/
    &rmiiCfg,  /*!< ENET rmii interface*/
    kEnetMdioHoldOneClkCycle,
    /*!< enet mac control flag recommended to use enet_mac_control_flag_t
      it is special control for loop mode, sleep mode, crc forward/terminate etc*/
    kEnetRxCrcFwdEnable | kEnetTxCrcBdEnable | kEnetMacEnhancedEnable,
    NULL,     /*!< ENET rxaccelerator config*/
    NULL,     /*!< ENET txaccelerator config*/
    {0, kEnetMinFifoAlmostEmpty, 0, kEnetMinFifoAlmostEmpty}, /*!< ENET Rx FIFO threshold*/
    {0, 0, 0, kEnetMinFifoAlmostEmpty, kEnetDefaultTxFifoAlmostFull}, /*!< ENET Tx FIFO threshold*/
#if FSL_FEATURE_ENET_SUPPORT_PTP
    false,
#endif
},
};

const enet_phy_config_t g_enetPhyCfg[HW_ENET_INSTANCE_COUNT] =
{{false, 0, false }};

/* ENET error describe list*/
static const char * ENET_errlist[kStatus_ENET_AlreadyAddedMulticast - kStatus_ENET_InvalidInput + 1] = {
    "Invaild ENET input parameter"          /* kStatus_ENET_InvalidInput*/
    "Invalid ENET device",                  /* kStatus_ENET_InvalidDevice */
    "Memory allocate failure",           /* kStatus_ENET_MemoryAllocateFail */
    "Get clock frequency failure",   /* kStatus_ENET_GetClockFreqFail */
    "ENET device already initialized",        /* kStatus_ENET_Initialized */
    "Open ENET device",      /* kStatus_ENET_Open */
    "Close ENET device failure",      /* kStatus_ENET_Close*/
    "NULL L2 PTP buffer queue pointer",      /* kStatus_ENET_Layer2QueueNull*/
    "Layer2 packet length over large",       /* kStatus_ENET_Layer2OverLarge*/
    "Layer2 packet buffer full",         /* kStatus_ENET_Layer2BufferFull*/
    "Layer2 packet error type",     /* kStatus_ENET_Layer2TypeError */
    "PTP ring buffer full",        /* kStatus_ENET_PtpringBufferFull*/
    "PTP ring buffer empty",         /* kStatus_ENET_PtpringBufferEmpty */
    "MII uninitialized",             /* kStatus_ENET_Miiuninitialized*/
    "Receive buffer descriptor invalid",   /* kStatus_ENET_RxbdInvalid */
    "Receive buffer descriptor empty",    /* kStatus_ENET_RxbdEmpty */
    "Receive buffer descriptor truncate", /* kStatus_ENET_RxbdTrunc */
    "Receive buffer descriptor error",   /* kStatus_ENET_RxbdError  */
    "Receive buffer descriptor full",    /* kStatus_ENET_RxBdFull  */
    "Small receive buffer size",           /* kStatus_ENET_SmallBdSize*/
    "Receive large buffer full",               /* kStatus_ENET_LargeBufferFull */
    "Transmit large packet",                  /* kStatus_ENET_TxLarge */
    "Transmit buffer descriptor full",        /* kStatus_ENET_TxbdFull*/
    "Transmit buffer descriptor Null",     /* kStatus_ENET_TxbdNull*/
    "Transmit data buffer Null",     /* kStatus_ENET_TxBufferNull*/
    "No more receive buffer left", /* kStatus_ENET_NoRxBufferLeft */
    "Invalid ENET PTP IOCTL command",   /* kStatus_ENET_UnknownCommand*/
    "ENET Timeout",         /* kStatus_ENET_TimeOut*/
    "Null multicast group pointer",         /* kStatus_ENET_MulticastPointerNull */
    "No multicast group address",  /* kStatus_ENET_NoMulticastAdd */
    "Have Already added to multicast group", /* kStatus_ENET_AlreadyAddedMulticast */
};

uint8_t *txBdPtr[HW_ENET_INSTANCE_COUNT], *rxBdPtr[HW_ENET_INSTANCE_COUNT];
uint8_t *txBuffer[HW_ENET_INSTANCE_COUNT], *rxBuffer[HW_ENET_INSTANCE_COUNT], *rxRtcsBuffer[HW_ENET_INSTANCE_COUNT];
uint8_t *rxExtBuffer[HW_ENET_INSTANCE_COUNT];
pcb_queue  packbuffer[HW_ENET_INSTANCE_COUNT];
PCB2 *pcbPtr[HW_ENET_INSTANCE_COUNT];
uint8_t *dataBuffQue;

#if FSL_FEATURE_ENET_SUPPORT_PTP
enet_mac_ptp_ts_data_t ptpTsRxData[ENET_PTP_RXTS_RING_LEN];
enet_mac_ptp_ts_data_t ptpTsTxData[ENET_PTP_TXTS_RING_LEN];
#endif

#if !ENET_RECEIVE_ALL_INTERRUPT
bool frameIsCollected = true;
#else
bool frameIsCollected = false;
#endif
#if BSPCFG_ENABLE_ENET_STATS
ENET_STATS enetStats;
#endif
OSA_TASK_DEFINE(ENET_receive, ENET_TASK_STACK_SIZE);

