jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_rtcs_adapter.c
    if(pcbPtr[enetIfPtr->deviceNumber])
    {
        OSA_MemFree(pcbPtr[enetIfPtr->deviceNumber]);
    }
    return kStatus_ENET_Success;
}


/*FUNCTION****************************************************************
 *
 * Function Name: ENET_free
 * Description: ENET packet buffer free.
 *
 *END*********************************************************************/
void ENET_free(PCB_PTR packet)
{
    enet_dev_if_t *param;
    uint8_t count;

    /* Check input Parameter*/
    if (packet == NULL)
    {
        return;
    }

    param = (enet_dev_if_t *)packet->PRIVATE;
    count = param->deviceNumber;

    if ((packet->FRAG[0].FRAGMENT != NULL) && frameIsCollected)
    {
        *(uint32_t *)packet->FRAG[0].FRAGMENT = 0;
        enet_mac_enqueue_buffer((void **)&dataBuffQue, packet->FRAG[0].FRAGMENT);

        /* Clear fragment in the packet*/
        packet->FRAG[0].FRAGMENT = NULL;
    }

    /* Add the used PCB buffer into the PCB buffer queue*/
    QUEUEADD(packbuffer[count].pcbHead, packbuffer[count].pcbTail, packet);


}

#if ENET_RECEIVE_ALL_INTERRUPT
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_find_receiver
 * Description: Find ENET tcp/ip upper layer functions.
 *
 *END*********************************************************************/
uint32_t ENET_find_receiver(void *enetPtr, enet_mac_packet_buffer_t *packetBuffer)
{
    uint8_t *packet, counter;
    uint16_t type, length = 0;
    PCB *pcbPtr;
    uint16_t *typePtr;
    enet_ecb_struct_t *ecbPtr;
    bool packetInvalid = ENET_ERROR;
    enet_dev_if_t *enetDevifPtr = (enet_dev_if_t *)enetPtr;

    /* Collect the frame first*/
    if(!packetBuffer[1].length)
    {
        packet = packetBuffer[0].data;  /* the frame with only one bd */
        length = packetBuffer[0].length;
        frameIsCollected = false;
    }
    else
    {
        /* Dequeue a large  buffer */
        packet = enet_mac_dequeue_buffer((void **)&dataBuffQue);
        if(packet!=NULL)
        {
            for(counter = 0; packetBuffer[counter].next != NULL ; counter ++)
            {
                memcpy(packet + length, packetBuffer[counter].data, packetBuffer[counter].length);
                length += packetBuffer[counter].length;
            }
        }
        else
        {
#if ENET_ENABLE_DETAIL_STATS
            enetDevifPtr->stats.statsRxDiscard ++;
#endif
            return kStatus_ENET_LargeBufferFull;
        }
        frameIsCollected = true;
    }

    /* Process the received frame*/
    typePtr = &((enet_ethernet_header_t *)packet)->type;
    type = RTCS_NTOHS((*typePtr));
    if(type == ENETPROT_8021Q)
    {
        typePtr = &((enet_8021vlan_header_t *)packet)->type;
        type = RTCS_NTOHS((*typePtr));
    }
    if(type <= kEnetMaxFrameDateSize)
    {
        enet_8022_header_ptr llcPtr = (enet_8022_header_ptr)(typePtr + 2);
        type = RTCS_NTOHS(llcPtr->type);
    }
#if FSL_FEATURE_ENET_SUPPORT_PTP
    if (type == ENETPROT_ETHERNET)
    {
        ENET_DRV_Service_l2packet(enetDevifPtr, &packetBuffer[0]);
    }
#endif
    for(ecbPtr = (enet_ecb_struct_t *)enetDevifPtr->netIfPrivate; ecbPtr; ecbPtr = ecbPtr->NEXT)
    {
        if(ecbPtr->TYPE == type)
        {
            packetInvalid = ENET_OK;
            /* Collect frame to PCB structure for upper layer process*/
            QUEUEGET(packbuffer[enetDevifPtr->deviceNumber].pcbHead,packbuffer[enetDevifPtr->deviceNumber].pcbTail, pcbPtr);
            if(pcbPtr)
            {
                pcbPtr->FRAG[0].LENGTH = length;
                pcbPtr->FRAG[0].FRAGMENT = packet;
                pcbPtr->FRAG[1].LENGTH = 0;
                pcbPtr->PRIVATE = enetDevifPtr;
                ecbPtr->SERVICE(pcbPtr, ecbPtr->PRIVATE);
           }
        }
    }

    return packetInvalid;
}
#endif
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_initialize
 * Return Value: The execution status.
 * Description:Initialize the ENET device.
 *
 *END*********************************************************************/
uint32_t ENET_initialize(uint32_t device, _enet_address address,uint32_t flag, _enet_handle *handle)
{
    enet_dev_if_t * enetIfPtr;
    uint32_t result;
    const enet_mac_config_t *macCfgPtr;
    enet_buff_config_t buffCfg;
    osa_status_t osaFlag;

    if (device > HW_ENET_INSTANCE_COUNT)
    {
        return kStatus_ENET_InvalidDevice;
    }

    /* Check the device status*/
    if (enetDevIf[device].isInitialized)
    {
        return kStatus_ENET_Initialized;
    }

    /* Initialize device*/
    enetIfPtr = (enet_dev_if_t *)&enetDevIf[device];
    if (HW_ENET_INSTANCE_COUNT == device)
    {
        enetIfPtr->next = NULL;
    }

    /* 	Configure strucutre*/
    enetIfPtr->deviceNumber = device;
    g_enetMacCfg[device].macAddr = address;
    macCfgPtr = &g_enetMacCfg[device];

#if ENET_RECEIVE_ALL_INTERRUPT
    enetIfPtr->enetNetifcall = ENET_find_receiver;
#endif

    /* Create sync signal*/
    OSA_MutexCreate(&enetIfPtr->enetContextSync);

    /* Initialize enet buffers*/
    result = ENET_buffer_init(enetIfPtr, &buffCfg);
    if(result != kStatus_ENET_Success)
    {
        return result;
    }
    /* Initialize ENET device*/
    result = ENET_DRV_Init(enetIfPtr, macCfgPtr, &buffCfg);
    if (result == kStatus_ENET_Success)
    {
        /* Initialize PHY*/
        if(g_enetPhyCfg[device].isAutodiscoverEnabled)
        {
            uint32_t phyAddr;
            result = PHY_DRV_Autodiscover(device, &phyAddr);
            if(result != kStatus_ENET_Success)
            return result;
            enetIfPtr->phyAddr = phyAddr;
        }
        else
        {
            enetIfPtr->phyAddr = g_enetPhyCfg[device].phyAddr;
        }

        PHY_DRV_Init(device, enetIfPtr->phyAddr, g_enetPhyCfg[device].isLoopEnabled);

        *handle = enetIfPtr;
        enetIfPtr->isInitialized = true;

#if !ENET_RECEIVE_ALL_INTERRUPT
    osaFlag = OSA_EventCreate(&enetIfPtr->enetReceiveSync, kEventAutoClear);
    if(osaFlag != kStatus_OSA_Success)
    {
        return osaFlag;
    }
    /* Create receive task*/
    osaFlag = OSA_TaskCreate(ENET_receive, "receive", ENET_TASK_STACK_SIZE, ENET_receive_stack, ENET_RECEIVE_TASK_PRIO, (task_param_t)enetIfPtr, false, &ENET_receive_task_handler);
    if(osaFlag != kStatus_OSA_Success)
    {
        return osaFlag;
    }
#endif

