jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_rtcs_adapter.c
        return ENET_OK;
    }
    else
    {
        ENET_DRV_Deinit(enetIfPtr);
        ENET_buffer_deinit(enetIfPtr);
        OSA_MutexDestroy(&enetIfPtr->enetContextSync);
#if !ENET_RECEIVE_ALL_INTERRUPT
        OSA_TaskDestroy(ENET_receive_task_handler);
        OSA_EventDestroy(&enetIfPtr->enetReceiveSync);
#endif
        *handle = NULL;
        return ENET_ERROR;
    }

}
#if !ENET_RECEIVE_ALL_INTERRUPT
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_open
 * Return Value: The execution status.
 * Description: Open the ENET device, This interface is used to add the private
 * address to the ENET device structure.
 *
 *END*********************************************************************/
uint32_t ENET_open(_enet_handle  handle, uint16_t type, void (* service)(PCB_PTR, void *), void *private)
{
    enet_dev_if_t * enetIfPtr;

    /* Check input parameter*/
    if ((!handle) || (!private))
    {
        return kStatus_ENET_InvalidInput;
    }

    enetIfPtr = (enet_dev_if_t *)handle;
    OSA_MutexLock(&enetIfPtr->enetContextSync, OSA_WAIT_FOREVER);

    /*add the upper layer netiIF structure into the device structure*/
    enetIfPtr->netIfPrivate = private;
    OSA_MutexUnlock(&enetIfPtr->enetContextSync);

    return ENET_OK;
}
#else
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_open
 * Return Value: The execution status.
 * Description: Open the ENET device, This interface is used to add the private
 * address to the enet device structure.
 *
 *END*********************************************************************/
uint32_t ENET_open(_enet_handle  handle, uint16_t type, void (* service)(PCB_PTR, void *), void *private)
{
    enet_dev_if_t * enetIfPtr;
    enet_ecb_struct_t *ecbPtr, **searchPtr;

    /* Check input parameter*/
    if ((!handle) || (!private))
    {
        return kStatus_ENET_InvalidInput;
    }

    enetIfPtr = (enet_dev_if_t *)handle;
    OSA_MutexLock(&enetIfPtr->enetContextSync, OSA_WAIT_FOREVER);
    for (searchPtr = (enet_ecb_struct_t **)(&enetIfPtr->netIfPrivate); *searchPtr; searchPtr = &(*searchPtr)->NEXT)
    {
        if ((*searchPtr)->TYPE == type)
        {
            OSA_MutexUnlock(&enetIfPtr->enetContextSync);
            return kStatus_ENET_Open;
        }
    }

    ecbPtr = (enet_ecb_struct_t *)OSA_MemAllocZero(sizeof(enet_ecb_struct_t));
    if (!ecbPtr)
    {
        OSA_MutexUnlock(&enetIfPtr->enetContextSync);
        return kStatus_ENET_MemoryAllocateFail;
    }
    ecbPtr->TYPE = type;
    ecbPtr->SERVICE = service;
    ecbPtr->PRIVATE = private;
    ecbPtr->NEXT = NULL;
    *searchPtr = ecbPtr;

    OSA_MutexUnlock(&enetIfPtr->enetContextSync);

    return ENET_OK;
}
#endif
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_shutdown
 * Return Value: The execution status.
 * Description: Stop the ENET device.
 *
 *END*********************************************************************/
uint32_t ENET_shutdown(_enet_handle handle)
{
    enet_dev_if_t * enetIfPtr;
    uint32_t result;

    /* Check the input parameter*/
    if (!handle)
    {
        return ENETERR_INVALID_DEVICE;
    }

    enetIfPtr = (enet_dev_if_t *)handle;

#if ENET_RECEIVE_ALL_INTERRUPT
    /* Make sure upper layers have closed the device*/
    if (enetIfPtr->netIfPrivate)
    {
        return ENETERR_INVALID_DEVICE;
    }
#endif
    /* Close the ENET device*/
    result = ENET_DRV_Deinit(enetIfPtr);
    if (result == kStatus_ENET_Success)
    {
        OSA_MutexDestroy(&enetIfPtr->enetContextSync);

#if !ENET_RECEIVE_ALL_INTERRUPT
        OSA_TaskDestroy(ENET_receive_task_handler);
        OSA_EventDestroy(&enetIfPtr->enetReceiveSync);
#endif
        return ENET_ERROR;
    }

    return ENET_OK;
}

#if !ENET_RECEIVE_ALL_INTERRUPT
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_receive
 * Description:  Net Receive interface.
 *
 *END*********************************************************************/
static void ENET_receive(task_param_t param)
{
    uint8_t *packet;
    uint16_t length = 0, type, counter = 0;
    uint32_t result;
    PCB *pcbPtr;
    uint16_t *typePtr;
    event_flags_t flag = 0x1, flagCheck;
    enet_mac_packet_buffer_t packetBuffer[kEnetMaxFrameBdNumbers];

    /* Init the packet buffer*/
    memset(&packetBuffer[0], 0, kEnetMaxFrameBdNumbers * sizeof(enet_mac_packet_buffer_t));
    for(counter = 0; counter < kEnetMaxFrameBdNumbers; counter++)
    {
        packetBuffer[counter].next = &packetBuffer[counter + 1];
    }
    counter = 0;

    /* Check input parameter*/
    if (!param)
    {
        return ;
    }
    enet_dev_if_t * enetIfPtr = (enet_dev_if_t *)param;

    while(1)
    {
        /* Init the packet buffer*/
        for(counter = 0; counter < kEnetMaxFrameBdNumbers; counter++)
        {
            packetBuffer[counter].data = NULL;
        }

        /* Receive frame*/
        result = ENET_DRV_ReceiveData(enetIfPtr, &packetBuffer[0]);
        if ((result == kStatus_ENET_RxbdEmpty) || (result == kStatus_ENET_InvalidInput))
        {
            OSA_EventWait(&enetIfPtr->enetReceiveSync, flag, false, OSA_WAIT_FOREVER, &flagCheck);
        }

        /* Process with the right packets*/
        if (packetBuffer[0].data != NULL)
        {
            /* Collect the frame first*/
            packet = enet_mac_dequeue_buffer((void **)&dataBuffQue);
            if (packet!=NULL)
            {
                length = 0;
                for(counter = 0; packetBuffer[counter].length != 0 ; counter ++)
                {
                    memcpy(packet + length, packetBuffer[counter].data, packetBuffer[counter].length);
                    length += packetBuffer[counter].length;
                    *(uint32_t *)(packetBuffer[counter].data) = 0;
                    enet_mac_enqueue_buffer((void **)&enetIfPtr->bdContext.extRxBuffQue, packetBuffer[counter].data);
                    packetBuffer[counter].length = 0;
                }
            }
            else
            {
#if ENET_ENABLE_DETAIL_STATS
                enetIfPtr->stats.statsRxMissed++;
#endif
            }

            /* Process the received frame*/
            typePtr = &((enet_ethernet_header_t *)packet)->type;
            type = RTCS_NTOHS((*typePtr));
            if (type == ENETPROT_8021Q)
            {
                typePtr = &((enet_8021vlan_header_t *)packet)->type;
                type = RTCS_NTOHS((*typePtr));
            }
            if (type <= kEnetMaxFrameDateSize)
            {
                enet_8022_header_ptr llcPtr = (enet_8022_header_ptr)(typePtr + 2);
                type = RTCS_NTOHS(llcPtr->type);
            }

#if FSL_FEATURE_ENET_SUPPORT_PTP
            if (type == ENETPROT_ETHERNET)
            {
                ENET_DRV_Service_l2packet(enetIfPtr, &packetBuffer[0]);
            }
#endif
            /* Collect frame to PCB structure for upper layer process*/
            QUEUEGET(packbuffer[enetIfPtr->deviceNumber].pcbHead, packbuffer[enetIfPtr->deviceNumber].pcbTail, pcbPtr);
            if (pcbPtr)
            {
                pcbPtr->FRAG[0].LENGTH = length;
                pcbPtr->FRAG[0].FRAGMENT = packet;
                pcbPtr->FRAG[1].LENGTH = 0;
                pcbPtr->PRIVATE = (void *)enetIfPtr;

                switch (type)
                {
                    case ENETPROT_IP:
                    IPE_recv_IP((PCB *)pcbPtr,enetIfPtr->netIfPrivate);
                        break;
                    case ENETPROT_ARP:
                    IPE_recv_ARP((PCB *)pcbPtr,enetIfPtr->netIfPrivate);
                        break;
#if RTCSCFG_ENABLE_IP6
                    case ENETPROT_IP6:
                    IP6E_recv_IP((PCB *)pcbPtr,enetIfPtr->netIfPrivate);
                        break;
#endif
                    default:
                    PCB_free((PCB *)pcbPtr);
                        break;
                }
            }
            else
            {
#if ENET_ENABLE_DETAIL_STATS
                enetIfPtr->stats.statsRxMissed++;
#endif
            }
        }
    }
}
#endif
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_send
 * Return Value: The execution status.
 * Description:  Net send interface. this is called by tcp/ip stack.
 *
 *END*********************************************************************/
uint32_t ENET_send(_enet_handle handle, PCB_PTR packet, uint32_t type, _enet_address dest, uint32_t flags)
{
    uint8_t headerLen, *frame;
    PCB_FRAGMENT *fragPtr;
    uint16_t size = 0, lenTemp = 0, bdNumUsed = 0;
    enet_dev_if_t *enetIfPtr;
    enet_ethernet_header_t *packetPtr;
    volatile enet_bd_struct_t * curBd;
    uint32_t result, lenoffset = 0;
    /*Check out*/
    if ((!handle) || (!packet))
    {
        return  kStatus_ENET_InvalidInput;
    }

    enetIfPtr = (enet_dev_if_t *)handle;
    /* Default frame header size*/
    headerLen = kEnetEthernetHeadLen;

    /* Check the frame length*/
    for (fragPtr = packet->FRAG; fragPtr->LENGTH; fragPtr++)
    {
        size += fragPtr->LENGTH;
    }
    if (size > enetIfPtr->maxFrameSize)
    {
#if ENET_ENABLE_DETAIL_STATS
        enetIfPtr->stats.statsTxLarge++;
#endif
        return kStatus_ENET_TxLarge;
    }

    /*Add MAC hardware address*/
    packetPtr = (enet_ethernet_header_t *)packet->FRAG[0].FRAGMENT;
    htone(packetPtr->destAddr, dest);
    htone(packetPtr->sourceAddr, enetIfPtr->macAddr);
    packetPtr->type = RTCS_HTONS(type);
    if (flags & ENET_OPT_8021QTAG)
    {
        enet_8021vlan_header_t *vlanHeadPtr = (enet_8021vlan_header_t *)packetPtr;
        vlanHeadPtr->tpidtag = RTCS_HTONS(ENETPROT_8021Q);
        vlanHeadPtr->othertag = RTCS_HTONS((ENET_GETOPT_8021QPRIO(flags) << 13));
        vlanHeadPtr->type = RTCS_HTONS(type);
        headerLen = sizeof(enet_8021vlan_header_t);
        packet->FRAG[0].LENGTH = headerLen;
    }

    if (flags & ENET_OPT_8023)
    {
        enet_8022_header_ptr lcPtr = (enet_8022_header_ptr)(packetPtr->type + 2);
        packetPtr->type = RTCS_HTONS(size - headerLen);
        lcPtr->dsap[0] = 0xAA;
        lcPtr->ssap[0] = 0xAA;
        lcPtr->command[0] = 0x03;
        lcPtr->oui[0] = 0x00;
        lcPtr->oui[1] = 0x00;
        lcPtr->oui[2] = 0x00;
        lcPtr->type = RTCS_HTONS(type);
        packet->FRAG[0].LENGTH = packet->FRAG[0].LENGTH+ sizeof(enet_8022_header_t);
    }

    /* Get the current transmit data buffer in buffer descriptor */
    curBd = enetIfPtr->bdContext.txBdCurPtr;
    frame = ENET_HAL_GetBuffDescripData(curBd);

    /* Send a whole frame with a signal buffer*/
    if(size <= enetIfPtr->bdContext.txBuffSizeAlign)
    {
        bdNumUsed = 1;
        for (fragPtr = packet->FRAG; fragPtr->LENGTH; fragPtr++)
        {
            memcpy(frame + lenTemp, fragPtr->FRAGMENT, fragPtr->LENGTH);
            lenTemp += fragPtr->LENGTH;
        }

        /* Send packet to the device*/
        result = ENET_DRV_SendData(enetIfPtr, size, bdNumUsed);
     
        /* Free the PCB buffer*/
        PCB_free(packet);
        return result;
    }

    /* Copy the Ethernet header first*/
     memcpy(frame, packet->FRAG[0].FRAGMENT, packet->FRAG[0].LENGTH);

    /* Send a whole frame with multiple buffer descriptors*/
    while((size - bdNumUsed* enetIfPtr->bdContext.txBuffSizeAlign) > enetIfPtr->bdContext.txBuffSizeAlign)
    {
        if(bdNumUsed == 0)
        {
            memcpy((void *)(frame + packet->FRAG[0].LENGTH), (void *)(packet->FRAG[1].FRAGMENT), enetIfPtr->bdContext.txBuffSizeAlign - packet->FRAG[0].LENGTH);
            lenoffset += (enetIfPtr->bdContext.txBuffSizeAlign - packet->FRAG[0].LENGTH);
        }
        else
        {
            memcpy((void *)frame, (void *)(packet->FRAG[1].FRAGMENT + lenoffset), enetIfPtr->bdContext.txBuffSizeAlign);
            lenoffset += enetIfPtr->bdContext.txBuffSizeAlign;
        }

