jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_rtcs_adapter.c
        /* Incremenet the buffer descriptor*/
        curBd = ENET_DRV_IncrTxBuffDescripIndex(enetIfPtr, curBd);
        frame = ENET_HAL_GetBuffDescripData(curBd);
        /* Increment the index and parameters*/
        bdNumUsed ++;
    }
     memcpy((void *)frame, (void *)(packet->FRAG[1].FRAGMENT + lenoffset), size - bdNumUsed * enetIfPtr->bdContext.txBuffSizeAlign);
     bdNumUsed ++;
    /* Send packet to the device*/
    result = ENET_DRV_SendData(enetIfPtr, size, bdNumUsed);

    /* Free the PCB buffer*/
    PCB_free(packet);

    return result;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_get_address
 * Return Value: The execution status.
 * Description:Get the ENET address of an initialized device
 *
 *END*********************************************************************/
uint32_t ENET_get_address(_enet_handle handle, _enet_address address)
{
    /* Check input param*/
    if (!handle)
    {
        return kStatus_ENET_InvalidInput;
    }

    enet_dev_if_t * enetIfPtr = (enet_dev_if_t *)handle;

    memcpy(address, enetIfPtr->macAddr, kEnetMacAddrLen);

    return ENET_OK;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_get_mac_address
 * Return Value: The execution status.
 * Description:Get the ENET address of an uninitialized device
 *
 *END*********************************************************************/
uint32_t ENET_get_mac_address(uint32_t device, uint32_t value, _enet_address address)
{
    uint8_t g_enetAddress[kEnetMacAddrLen] = ENET_DEFAULT_MAC_ADD;

    address[0] = g_enetAddress[0];
    address[1] = g_enetAddress[1];
    address[2] = g_enetAddress[2];
    address[3] = (value & 0xFF00000U)>>16;
    address[4] = (value & 0xFF00U) >> 8;
    address[5] = (value & 0xFFU);

    return ENET_OK;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_join
 * Return Value: The execution status.
 * Description: Join a multicast group.
 *
 *END*********************************************************************/
uint32_t ENET_join(_enet_handle handle, uint16_t type, _enet_address address)
{
    enet_dev_if_t * enetIfPtr = (enet_dev_if_t *)handle;
    enet_multicast_group_t *enetMultiGroupPtr;
    uint32_t hash;

    /* Make sure it's a multicast group*/
    if (!(address[0] & 1U))
    {
       return kStatus_ENET_NoMulticastAddr;
    }

    OSA_MutexLock(&enetIfPtr->enetContextSync, OSA_WAIT_FOREVER);

    if (!enetIfPtr->multiGroupPtr)
    {
        enetIfPtr->multiGroupPtr = OSA_MemAlloc(sizeof(enet_multicast_group_t));
        if (enetIfPtr->multiGroupPtr == NULL)
        {
            OSA_MutexUnlock(&enetIfPtr->enetContextSync);
            return kStatus_ENET_MemoryAllocateFail;
        }
        memcpy(enetIfPtr->multiGroupPtr->groupAdddr, address, kEnetMacAddrLen);
        ENET_DRV_AddMulticastGroup(enetIfPtr->deviceNumber, address, &hash);
        enetIfPtr->multiGroupPtr->hash = hash;
        enetIfPtr->multiGroupPtr->next = NULL;
        enetIfPtr->multiGroupPtr->prv = NULL;
    }
    else
    {
        /* Check if we had add the multicast group*/
        enetMultiGroupPtr = enetIfPtr->multiGroupPtr;
        while (enetMultiGroupPtr != NULL)
        {
            if (!memcmp(enetMultiGroupPtr->groupAdddr, address, kEnetMacAddrLen))
            {
                OSA_MutexUnlock(&enetIfPtr->enetContextSync);
            	return kStatus_ENET_AlreadyAddedMulticast;
            }
            if (enetMultiGroupPtr->next == NULL)
            {
                break;
            }
            enetMultiGroupPtr =  enetMultiGroupPtr->next;
        }

        /* Add this multicast group*/
        enetMultiGroupPtr->next = OSA_MemAllocZero(sizeof(enet_multicast_group_t));
        if (enetMultiGroupPtr->next == NULL)
        {
            OSA_MutexUnlock(&enetIfPtr->enetContextSync);
            return kStatus_ENET_MemoryAllocateFail;
        }
        memcpy(enetMultiGroupPtr->next->groupAdddr, address, kEnetMacAddrLen);
        ENET_DRV_AddMulticastGroup(enetIfPtr->deviceNumber, address, &hash);
        enetMultiGroupPtr->next->hash = hash;
        enetMultiGroupPtr->next->next = NULL;
        enetMultiGroupPtr->next->prv = enetMultiGroupPtr;
    }

    OSA_MutexUnlock(&enetIfPtr->enetContextSync);
    return ENET_OK;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_leave
 * Return Value: The execution status.
 * Description: Leave a multicast group.
 *
 *END*********************************************************************/
uint32_t ENET_leave(_enet_handle handle, uint16_t type, _enet_address address)
{
    enet_dev_if_t * enetIfPtr = (enet_dev_if_t *)handle;
    enet_multicast_group_t *enetMultiGroupPtr, *enetTempPtr;

    /* Make sure it's a multicast group*/
    if (!(address[0] & 1U))
    {
       return kStatus_ENET_NoMulticastAddr;
    }

    OSA_MutexLock(&enetIfPtr->enetContextSync, OSA_WAIT_FOREVER);

    if (!enetIfPtr->multiGroupPtr)
    {
        OSA_MutexUnlock(&enetIfPtr->enetContextSync);
        return kStatus_ENET_MulticastPointerNull;
    }

    /* Check if we had add the multicast group*/
    for (enetMultiGroupPtr = enetIfPtr->multiGroupPtr; enetMultiGroupPtr != NULL;enetMultiGroupPtr = enetMultiGroupPtr->next )
    {
        if (!memcmp(enetMultiGroupPtr->groupAdddr, address, kEnetMacAddrLen))
        {
            ENET_DRV_LeaveMulticastGroup(enetIfPtr->deviceNumber, address);
            memset(enetMultiGroupPtr->groupAdddr, 0, kEnetMacAddrLen);
            enetTempPtr = enetMultiGroupPtr->prv;
            if (enetTempPtr != NULL)
            {
                enetTempPtr->next = enetMultiGroupPtr->next;
            }
            if (enetMultiGroupPtr->next != NULL)
            {
                enetMultiGroupPtr->next->prv = enetTempPtr;
            }
            OSA_MemFree((void *)enetMultiGroupPtr);
            break;
        }
    }

    OSA_MutexUnlock(&enetIfPtr->enetContextSync);

