jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_rtcs_adapter.c
    return ENET_OK;
}

#if BSPCFG_ENABLE_ENET_STATS
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_get_stats
 * Return Value: The execution status.
 * Description: Get ENET packets statistic.
 *
 *END*********************************************************************/
ENET_STATS_PTR ENET_get_stats(_enet_handle handle)
{
#if ENET_ENABLE_DETAIL_STATS
    /* Common stats*/
    memcpy(&enetStats.COMMON, &((enet_dev_if_t *)handle)->stats, sizeof(enetStats.COMMON));
    /* Detail stats*/
    enetStats.ST_RX_ALIGN = ((enet_dev_if_t *)handle)->stats.statsRxAlign;
    enetStats.ST_RX_FCS = ((enet_dev_if_t *)handle)->stats.statsRxFcs;
    enetStats.ST_RX_GIANT = ((enet_dev_if_t *)handle)->stats.statsRxLengthGreater;
    enetStats.ST_RX_LATECOLL = ((enet_dev_if_t *)handle)->stats.statsRxCollision;
    enetStats.ST_RX_OVERRUN = ((enet_dev_if_t *)handle)->stats.statsRxOverRun;
    enetStats.ST_RX_RUNT = ((enet_dev_if_t *)handle)->stats.statsRxTruncate;
    enetStats.ST_TX_EXCESSCOLL = ((enet_dev_if_t *)handle)->stats.statsTxExcessCollision;
    enetStats.ST_TX_UNDERRUN = ((enet_dev_if_t *)handle)->stats.statsTxUnderFlow;
    enetStats.ST_TX_LATECOLL = ((enet_dev_if_t *)handle)->stats.statsTxLateCollision;

    enetStats.ST_TX_COPY_LARGE = ((enet_dev_if_t *)handle)->stats.statsTxLarge;
#endif
    return (ENET_STATS_PTR)&enetStats;
}
#endif
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_link_status
 * Return Value: True if link is up else false.
 * Description: Get ENET link status.
 * If ENET is link up return true else false.
 *
 *END*********************************************************************/
bool ENET_link_status(_enet_handle handle)
{
    enet_dev_if_t * enetIfPtr;
    bool status = false;

    /* Check input parameter*/
    if (handle == NULL)
    {
        return kStatus_ENET_InvalidDevice;
    }
    enetIfPtr = (enet_dev_if_t *)handle;

    PHY_DRV_GetLinkStatus(enetIfPtr->deviceNumber, enetIfPtr->phyAddr, &status);
    return status;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_get_speed
 * Return Value: The link speed.
 * Description: Get ENET link speed.
 *
 *END*********************************************************************/
uint32_t ENET_get_speed(_enet_handle handle)
{
    enet_dev_if_t * enetIfPtr;
    enet_phy_speed_t speed;
    uint32_t result;

    /* Check input parameter*/
    if (handle == NULL)
    {
        return kStatus_ENET_InvalidDevice;
    }

    enetIfPtr = (enet_dev_if_t *)handle;
    result = PHY_DRV_GetLinkSpeed(enetIfPtr->deviceNumber, enetIfPtr->phyAddr, &speed);
    if (result != kStatus_ENET_Success)
    {
        return result;
    }
    else
    {
        if (speed == (uint32_t)kEnetSpeed100M)
        {
            return 100;
        }
        else if (speed == (uint32_t)kEnetSpeed10M)
        {
            return 10;
        }
    }

    return ENET_ERROR;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_get_MTU
 * Return Value: The value of MTU.
 * Description: Get ENET MTU.
 *
 *END*********************************************************************/
uint32_t ENET_get_MTU(_enet_handle handle)
{
    enet_dev_if_t * enetIfPtr;

    /* Check input parameter*/
    if (handle == NULL)
    {
        return kStatus_ENET_InvalidDevice;
    }

    enetIfPtr = (enet_dev_if_t *)handle;
    if (!enetIfPtr->maxFrameSize)
    {
        return kEnetMaxFrameDateSize;
    }

    if (enetIfPtr->isVlanTagEnabled)
    {
        return enetIfPtr->maxFrameSize - kEnetEthernetHeadLen - kEnetFrameFcsLen;
    }
    else
    {
       return enetIfPtr->maxFrameSize - sizeof(enet_8021vlan_header_t) - kEnetFrameFcsLen;
    }
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_phy_register
 * Return Value: The number of registers .
 * Description: Read required ENET PHY registers.
 *
 *END*********************************************************************/
bool ENET_phy_registers(_enet_handle handle, uint32_t numRegs, uint32_t *regPtr)
{
    uint32_t counter;
    enet_dev_if_t *enetIfPtr;

    /* Check input parameter*/
    if (handle == NULL)
    {
        return kStatus_ENET_InvalidDevice;
    }

    enetIfPtr = (enet_dev_if_t *)handle;
    if (!enetIfPtr->maxFrameSize)
    {
        return kEnetMaxFrameDateSize;
    }

    for (counter = 0; counter < numRegs; counter++)
    {
        *regPtr = 0;
        if (PHY_DRV_Read(enetIfPtr->deviceNumber, enetIfPtr->phyAddr, counter, regPtr) != kStatus_ENET_Success)
        {
            return false;
        }
        regPtr ++;
    }
    return true;
}
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_get_next_device_handle
 * Return Value: The device structure address .
 * Description: Get the next device structure address.
 *
 *END*********************************************************************/
_enet_handle ENET_get_next_device_handle(_enet_handle handle)
{
    enet_dev_if_t * enetIfPtr;

    /* Check input parameter*/
    if (handle == NULL)
    {
        return NULL;
    }

    enetIfPtr = (enet_dev_if_t *)handle;

    return (void *)enetIfPtr->next;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_get_options
 * Return Value: The device structure address.
 * Description: Get device option.
 *
 *END*********************************************************************/
uint32_t ENET_get_options(_enet_handle handle)
{
    enet_dev_if_t * enetIfPtr;
    uint32_t option = 0;

    /* Check input parameter*/
    if (handle == NULL)
    {
        return kStatus_ENET_InvalidDevice;
    }

    enetIfPtr = (enet_dev_if_t *)handle;

    if((g_enetMacCfg[enetIfPtr->deviceNumber].macCtlConfigure & kEnetRxAccelEnable) &&
         (g_enetMacCfg[enetIfPtr->deviceNumber].rxAccelerPtr != NULL))
    {
        if (g_enetMacCfg[enetIfPtr->deviceNumber].rxAccelerPtr->isIpcheckEnabled)
        {
            option |= ENET_OPTION_HW_RX_IP_CHECKSUM;
        }
        if (g_enetMacCfg[enetIfPtr->deviceNumber].rxAccelerPtr->isProtocolCheckEnabled)
        {
            option |= ENET_OPTION_HW_RX_PROTOCOL_CHECKSUM;
        }
        if (g_enetMacCfg[enetIfPtr->deviceNumber].rxAccelerPtr->isMacCheckEnabled)
        {
            option |= ENET_OPTION_HW_RX_MAC_ERR;
        }
    }
    if((g_enetMacCfg[enetIfPtr->deviceNumber].macCtlConfigure & kEnetTxAccelEnable)
        && (g_enetMacCfg[enetIfPtr->deviceNumber].txAccelerPtr != NULL))
    {
        if (g_enetMacCfg[enetIfPtr->deviceNumber].txAccelerPtr->isIpCheckEnabled)
        {
            option |= ENET_OPTION_HW_TX_IP_CHECKSUM;
        }
        if (g_enetMacCfg[enetIfPtr->deviceNumber].txAccelerPtr->isProtocolCheckEnabled)
        {
            option |= ENET_OPTION_HW_TX_PROTOCOL_CHECKSUM;
        }
    }

    return option;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_close
 * Return Value: The execution status.
 * Description: Unregisters a protocol type on an Ethernet channel.
 *
 *END*********************************************************************/
uint32_t ENET_close(_enet_handle handle, uint16_t type)
{
#if !ENET_RECEIVE_ALL_INTERRUPT

