jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_rtcs_adapter.c
    /* Check input parameter*/
    if (handle == NULL)
    {
        return kStatus_ENET_InvalidDevice;
    }
#else
    enet_dev_if_t *enetIfPtr;
    enet_ecb_struct_t *ecbPtr, **searchPtr;

    /* Check input parameter*/
    if (handle == NULL)
    {
        return kStatus_ENET_InvalidDevice;
    }
    enetIfPtr = (enet_dev_if_t *)handle;
    OSA_MutexLock(&enetIfPtr->enetContextSync, OSA_WAIT_FOREVER);

    for (searchPtr = (enet_ecb_struct_t **)&enetIfPtr->netIfPrivate;
        *searchPtr; searchPtr = &(*searchPtr)->NEXT)
    {
        if ((*searchPtr)->TYPE == type)
        {
            break;
        }
    }

    if (!*searchPtr)
    {
        OSA_MutexUnlock(&enetIfPtr->enetContextSync);
        return kStatus_ENET_Close;
    }

    ecbPtr = *searchPtr;
    *searchPtr = ecbPtr->NEXT;

    OSA_MutexUnlock(&enetIfPtr->enetContextSync);
    OSA_MemFree(ecbPtr);

#endif

    return ENET_OK;
}
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_mediactl
 * Return Value: The execution status.
 * Description: ENET mediactl interface.
 *
 *END*********************************************************************/
uint32_t ENET_mediactl(_enet_handle handle, uint32_t commandId, void *inOutParam)
{
    return ENET_OK;
}

/*FUNCTION*-------------------------------------------------------------
*
*  Function Name : ENET_strerror
*  Returned Value: pointer to error string
*  Description: Describe an ENET error code
*
*END*-----------------------------------------------------------------*/
const char * ENET_strerror(uint32_t  error)
{
    if (error == ENET_OK)
    {
        return "OK";
    }
    if ((error < kStatus_ENET_InvalidInput) || (error > kStatus_ENET_AlreadyAddedMulticast))
    {
        return "Unknown error";
    }
    return ENET_errlist[error - kStatus_ENET_InvalidInput];
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
